[
{
"id": 1,
"title": "Our Future Home",
"description": "A soft, sunlit home that feels like a secret world just for us — warm wooden floors, gentle morning light on the walls, and the quiet comfort of knowing we wake up next to each other every day.",
"image": "https://i.pinimg.com/736x/73/52/3a/73523ac856963d643c116bb63d1132da.jpg"
},
{
"id": 2,
"title": "London Adventures",
"description": "Foggy streets, city lights, and us walking hand in hand along the river — coffee in one hand, your hand in the other, as we explore London like it was always waiting for us.",
"image": "https://i.pinimg.com/736x/b9/20/b6/b920b6848e1d2ec9919068d75dbc5c8f.jpg"
},
{
"id": 3,
"title": "Christmas Together",
"description": "Soft fairy lights, warm blankets, hot chocolate, and the quiet magic of our first real Christmas together — the kind where the best gift is simply being in the same room, breathing the same cozy air.",
"image": "https://i.pinimg.com/736x/67/b5/66/67b566c96f9c926bf587faf8b7f8475d.jpg"
},
{
"id": 4,
"title": "Roses For You",
"description": "A gentle bouquet of roses that will always look a little bit like you — soft, delicate, and quietly powerful, carrying a promise that I will keep choosing you, day after day.",
"image": "https://i.pinimg.com/1200x/0e/09/93/0e0993bffe7a103fe29e8d2ab8a5c121.jpg"
},
{
"id": 5,
"title": "Pink Rabbit & Blue Fairy Boy",
"description": "Our little fairytale — a pink rabbit girl and a blue fairy boy, meeting under a soft glowing tree in a world that exists only for them, where every hop and flutter says: ‘I’m here, I’m yours.’",
"image": "https://i.pinimg.com/736x/2e/39/09/2e390960efd3c83522919beee6af31cf.jpg"
},
{
"id": 6,
"title": "Marriage & Rings",
"description": "Two rings, one quiet ‘yes’, and a lifetime in between — the moment when the world softens and it’s just us, promising to be each other’s safest place, in every version of the future.",
"image": "https://i.pinimg.com/736x/97/0b/d7/970bd7ab778f81ddf98b7b07a7f555c5.jpg"
},
{
"id": 7,
"title": "Cozy Evenings With You",
"description": "Dim lights, shared blankets, whispered jokes, and the kind of silence that feels full instead of empty — evenings where time slows down and the only plan is to be close to you.",
"image": "https://i.pinimg.com/736x/1b/c3/90/1bc390e713b15644d99969d8dba91c57.jpg"
},
{
"id": 8,
"title": "Our 2025 / 2026 Dreams",
"description": "All the things we’re building together — degrees, careers, countries, and quiet little rituals — a map of our dreams for 2025 and 2026, with a small note in the corner that says: ‘We did this together.’",
"image": "https://i.pinimg.com/736x/c2/4c/5d/c24c5d990a8ac0f9f4a2b288d406c1de.jpg"
}
]
