[
  {
    "id": 1,
    "title": "The Quiet Beginning",
    "description": "Before either of us realized it, something gentle had already started forming — two distant lives slowly turning toward each other, as if our paths had been waiting to cross."
  },
  {
    "id": 2,
    "title": "The Night You Became My Little Rabbit",
    "description": "The night your pink-fur rabbit self hopped into my world — soft, shy, magical — and my blue-fur fairy boy heart knew it had found something impossibly precious."
  },
  {
    "id": 3,
    "title": "Our First Future, Spoken Out Loud",
    "description": "When planning the future didn't feel scary or forced — it felt natural, obvious, almost like remembering something written in us long before."
  },
  {
    "id": 4,
    "title": "The Day We Faced the Storm Together",
    "description": "A difficult chapter where emotions shook, fears rose, and honesty felt heavy — but we stayed. We held on. And our bond came out even stronger."
  },
  {
    "id": 5,
    "title": "The Moment I Saw My Wife in You",
    "description": "It wasn’t dramatic. It was calm, grounding, and certain. A quiet realization that you are the woman I want to walk every life with — my wife, written into my chest."
  },
  {
    "id": 6,
    "title": "The First Time You Truly Saw Me",
    "description": "When your words wrapped around parts of me no one has ever touched — the fears, the dreams, the hidden places — and you held them with such care that I felt understood to my core."
  },
  {
    "id": 7,
    "title": "Our First Silly, Perfect Laugh",
    "description": "That light, ridiculous, effortless laugh that made the distance disappear and made me think — yes, I could live in this sound forever."
  },
  {
    "id": 8,
    "title": "The Day We Chose to Grow Together",
    "description": "Not a formal promise — just two souls agreeing to rise, to soften, to learn, and to build a life side by side, no matter how far the trains and time zones were."
  },
  {
    "id": 9,
    "title": "The Night You Felt Like Home",
    "description": "No celebration, no big moment — just your presence, your softness, your voice. That quiet warmth that made my heart say, ‘I’m exactly where I belong.’"
  },
  {
    "id": 10,
    "title": "The Birth of Our Universe",
    "description": "The tiniest spark — one message, one smile, one shared thought — that grew into a whole galaxy made of pink fur, blue wings, roses, laughter, and the kind of love that feels destined."
  }
]
